#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
//C语言类型
//1.内置类型
// char
// short
// int
// long
// float
// double
//2.自定义类型
//int main()
//{
//	int a = 10;
//	float f = 10.0;
//	return 0;
//}
//int main()
//{
//	int a = 20;
//	//00000000000000000000000000010100 - 原码
//	//00000000000000000000000000010100 - 反码
//	//00000000000000000000000000010100 - 补码
//	//
//	int b = -10;
//	//10000000000000000000000000001010 - 原码
//	//11111111111111111111111111110101 - 反码
//	//10000000000000000000000000001010 - 补码
//	return 0;
//}

//整数
//1.有符号数：正数：原反补相同
//            负数：不同，需进行计算
//2.无符号数：

//int main()
//{
//	//写一段代码
//	int a = 1;
//	char* p = (char*)&a;
//	if (*p == 1)
//	{
//		printf("小段\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}

//int check_sys();
//{
//	int a = 1;
//	char* p = (char*)&a;
//	if (*p == 1)
//		return 1;
//	else
//		return 0;
//	//return *(char*)&a;
//}
//指针类型的意义：
//指针类型决定了指针解引用操作符能狗访问几个字节
//int main()
//{
//	//返回1，小端
//	//返回0，大端
//	int ret = check_sys();
//	if (ret == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}

int main()
{
	char a = -128;
	printf("%u\n", a);
	//%d - 打印十进制的有符号数字
	//%u - 打印十进制的无符号数字
	return 0;
}